;~ =============================================================================
;~ Rizonesoft Language File
;~ =============================================================================
;~ Date.........: 28 February 2018
;~ Author.......: Derick Payne (Rizonesoft)
;~ Link.........: www.rizonesoft.com
;~ =============================================================================

[Main]
Product = USB اصلاح 
Version = 8

[Language]
Name = Arabic
Code = ar
Encoding = Unicode (UTF-16) LE BOM

[Translations]
About = حول
Custom = مخصص
Donate = تبرّع
Logging = تسجيل
Menus = القوائم
Messages = الرسائل
Messages2 = الرسائل2
Preferences = المفضلة
Update = تحديث
Versioning = تعيين الاصدار

[About]
Window_Title = ٪{Program.Name} حول
Label_Version = الاصدار
Label_AutoIt = البناء باستخدام اصدار النص التلقائي
Label_Copyright = حق المؤلف
Tip_Title_Donate = تبرّع
Tip_Message_Donate = ابقاء الاضواء مضاءة وجعل البرامج المجانية عالية الجودة؟ انقر هنا للتبرع.\rn هل تفكر في هدية صغيرة بقيمة 10 دولارات لمساعدتنا
Label_Home = الصفحة الرئيسية
Label_License = الرخصة
Label_Support = الحصول على الدعم
Tip_Title_Country = صنع في جنوب افريقيا
Tip_Message_Country = %{Program.Name} ولد في جنوب افريقيا.
Label_Contributors = المساهمون
Tip_Facebook = مثلنا في الفيسبوك.
Tip_Twitter = تابعونا على تويتر.
Tip_GooglePlus = ابحث عنا في جوجل.
Tip_GitHub = %{Program.Name} on GitHub.
Button_Ok = موافق
Label_RAM = RAM) ٪d MB خالية من ٪d MB (٪d٪
Tip_RAM = ذاكرة الوصول العشوائي
Label_HDD = %s) %.2f GB FREE OF %.2f GB (%d%

[Custom]
Label_Status_Welcome = واعد تشغيل الحاسوب. تذكر انشاء نقطة استعادة النظام قبل المتابعة.'%s' فانقر فوقUSB ، او اذا كنت تواجه مشكلات اخرى متعلقة بـ USB اذا فشل تثبيت محرك اقراص 
Label_Status_Updates = يتم الآن البحث عن التحديثات
Label_Status_Warning =  فقد يؤدي ذلك الى كسر شيء ما. USB ، يرجى عدم تشغيل هذه الاداة المساعدة اذا كنت لا تواجه مشكلات في 
Button_Repair = USB اصلاح 

[Donate]
Label_Heading = ساعة. الآن ، ماذا عن التبرع الصغير %d بخدمتك لاكثر من %{Program.Name} قام؟?
Label_Message = تبرع بقيمة 20 دولار سيبقينا مستمرين لشهر على الاقل Rizonesoft.ادناه، واختر مبلغا وارسل لنا التبرع. سيتم استخدام تبرعك لتحسين برنامجنا والحفاظ على كل شيء مجاني على  PayPal انقر على زر.
Label_Donate = وابقاء الاضواء مضاءة %{Program.Name} هل تفكر في هدية صغيرة بقيمة 10 دولارات لمساعدتنا على تحسين؟

[Logging]
Finished = منته
success = نجاح
Response_Received = الرد الذي تم تلقيه
Successfully = نجاح
OK = موافق!
Registration_succeeded = نجاح التسجيل
Initiated = بدات
Error = خطا
Failed = فشل
Access_Denied = تم رفض الوصول
No_Operation_Performed = لا يمكن تنفيذ اي عملية
VERSION = الاصدار
File_Not_Found = '%s' تعذر العثور على ملف السجل.
Showing_File = '%s' اظهار ملف السجل.
Showing_Error = %s:حدث خطا ما: هوية العملية
Opening_File = فتح ملف السجل.
Opening_Directory = فتح مجلد السجل...
Directory_Not_Found = '%s' تعذر العثور على دليل السجل.
Showing_Directory = '%s' اظهار دليل سجل.
Bool_Yes = نعم
Bool_No = لا
Info_Date = التاريخ:
Info_Program = برنامج:
Info_Program_Path = مسار البرنامج:
Info_Compiled = تجميع:
Info_AutoIt_Version = AutoIt الاصدار:
Info_AutoIt_64Bit = تلقائيًا، يمكنك اصدار 64 بت:
Info_Windows_Version = اصدار ويندوز:
Info_System_Type = نوع النظام:
Info_Memory = (RAM) الذاكرة:
Info_ProgramFiles = دليل ملفات البرنامج:
Info_Windows_Directory = دليل ويندوز:
Level_Error = خطاء:
Level_Warning = تحذير:
Level_Success = نجاح:
Level_Finished = منته:

[Menus]
File = &ملف
File_Preferences = &التفضيلات
File_Logging = &تسجيل
File_Logging_Open_File = فتح ملف &السجل
File_Logging_Open_Directory = فتح السجل &الدليل
File_Reboot = &اعادة تشغيل ويندوز
File_Close = &اغلاق\tAlt+F4
Troubleshoot = &استكشاف الاخطاء
Troubleshoot_Hardware = استكشاف الاخطاء &اصلاحها باستخدام الاجهزة
Tools = الاد&وات
Tools_System_Restore = &انشاء نقطة استعادة وندوز
Tools_Device_Manager = &مدير و جهاز
Help = &التعليمات
Help_Update = &التحقق من وجود تحديثات
Help_Home = ٪{Company.Name} &الصفحة الرئيسية
Help_Downloads = المزيد &التنزيلات
Help_Support = &الحصول على الدعم
Help_Issue = انشاء &مشكلة
Help_Donate = تبرع ل&قضيتنا 
Help_About = ٪{Program.Name} حول
Debug = &تصحيح

[Messages]
Info_Title = يرجى الاحاطة علما
Warning_Title = تحذير!
Error_Title = عفوا! حدث خطا ما!
Error_Oops = عفوا!
Singleton = ٪{Program.Name} يتم بالفعل تشغيل تواجد آخر لـ.
Compatible = غير قابل للتكاء مع اصدار الاطارات. اذا كنت تعتقد ان هذا خطا، فلا تتردد في ترك رسالة في '٪s' مع كل التفاصيل.٪{Program.Name}.
Compatible_Bit = '%s' 64 بت من %{Program.Name} 32 بت غير متوافق مع اصدار وندوز الخاص بك. الرجاء تنزيل %{Program.Name} لسوء الحظ
Loading_Initializing = ٪{Program.Name} تهيئة
Loading_Localizations = تحميل التعريبات
Loading_Resources = تعيين الموارد
Loading_WorkingDirectories = تعيين الدلائل العاملة
Loading_Logging = تهيئة التسجيل
Loading_Configuration = تحميل التكوين
Loading_Shortcuts = تعيين اختصارات لوحة المفاتيح
Loading_Interface = بدء واجهة اساسية
Ping_Check_Connection = التحقق من اتصال انترنت.
Ping_Response = تم تلقي الاستجابة بالمللي ثانية٪.
Ping_Host_Offline = المضيف غير متصل.
Ping_Host_Unreachable = المضيف غير قابل للوصول.
Ping_Host_Bad = الوجهة السيئة.
Ping_Host_No_Internet = لا يوجد اتصال بالانترنت.
Global_Errors = (٪02i) ٪s! تم الانتهاء من!
Global_Errors_Error = خطا
Global_Errors_Errors = اخطاء
Global_Finished = المهمة المحددة المكتملة.
Global_File = ملف
Global_Files = ملفات
RegisterDll_Success = RegSvr32.exe > '%s' نجح التسجيل.
RegisterDll_Error_01 = لتسجيل وحدة نمطية، يجب توفير اسم ثنائي.RegSvr32.exe > '%s'.
RegisterDll_Error_02 = غير موجودة '%s' الوحدة النمطية المحددة RegSvr32.exe>.
RegisterDll_Error_03 = لنقطة الادخال DllRegisterServer ولكن لم يتم العثور على '%s' تم تحميل الوحدة النمطية RegSvr32.exe>.
RegisterDll_Error_04 = 0x80070005 رقم الخطا RegSvr32.exe > '%s'
Registry_Write_Error = '%s'تعذر الكتابة الى
Registry_Error_01 = تعذر فتح المفتاح المطلوب.
Registry_Error_02 = تعذر فتح المفتاح الرئيسي المطلوب.
Registry_Error_03 = تعذر فتح القيمة المطلوبة.
Registry_Error_04 = نوع القيمة غير معتمد.
Registry_Error_05 = غير قادر على حذف القيمة المطلوبة.
Registry_Error_06 = تعذر حذف المفتاح/القيمة المطلوبة.

[Messages2]
Boot_01 = قد تكون هناك حاجة الى اعادةلاقلاع النظام قبل ان تدخل الاعدادات حيز التنفيذ.
Boot_02 = الى اعادة الاقلاع او عدم اعادة الاقلاع؟?
Boot_03 = قد تحتاج الى اعادة اقلاع حاسوبك قبل ان تدخل الاعدادات حيز التنفيذ. هل ترغب في اعادة اقلاع الحاسوب الآن؟ حفظ اشياك ، وحبس انفاسك و اضغط على نعم لاعادة اقلاع حاسوبك. او اضغط على لا للتجاهلي.
Boot_04 = ^ انت لا تريد ان يعيد حاسوبك? الاقلاع?
Boot_05 = ^ لا يمكن ان يجادل في ذلك. فمن حاسوبك بعد كل شيء.
Boot_06 = لاعادة اقلاع الحاسوب لاحقا.'٪s' ثم '٪s'انقر.
Boot_07 = اعادة اقلاع الوندوز...
MsgBox_Boot_Title = اعادة الاقلاع!
MsgBox_Boot_Message = سيتم اعادة اقلاع الحاسوب في ٪s ثانية. هذا سيعطيك الوقت الكافي لانقاذ اغراضك اضغط موافق لاعادة اقلاع الحاسوب الآن.
Boot_Restarting = يتم اعادة تشغيل الحاسوب.
Boot_Canceled = تم الغاء اعادة الاقلاع.
Repair_USB_01 = والمحاور USB اصلاح وحدات تحكم مضيف.
Repair_USB_02 = الخاصة بك. اذا لم يكن الامر كذلك ، فقد تكون مشكلة مادية في الجهاز  USB آمل ان يكون هذا قد حل مشكلات.

[Preferences]
Window_Title = المفضلة
Tab_General = عام
Tab_Performance = اداء
Tab_Language = اللغة
Group_Logging = تسجيل
Group_Priority = اولوية
Group_Memory = الذاكرة
Group_Language = اللغة
Checkbox_Enable_Logging = تمكين التسجيل
Label_Log_Exceed = يجب الا يتجاوز حجم السجل:
Label_Logging_Size = ك ب %s:حجم التسجيل
Button_Logging_Clear = مسح التسجيل
Label_SetPriority = تعيين اولوية العملية:
Checkbox_SaveRealtime = (حفظ الاولوية اعلى عالية (غير مستحسن.
Checkbox_ReduceMemory = تقليل الذاكرة على انظمة الذاكرة المنخفضة.
Label_Language_Message = (حدد اللغة التي تفضلها و اضغط على الزر ٪s للمتابعة. (مطلوب اعادة التشغيل
Button_Save = حفظ
Button_Cancel = الغاء الامر
Label_Updated = تم تحديث التفضيلات
Label_Logging_Cleared = تم مسح التسجيل
MsgBox_Language_Title = اللغة التي تم تغييرها
MsgBox_Language_Message = حتى تسري اللغة المختارة %{Program.Name} تم تغيير اللغة المحددة. يجب اعادة تشغيل.
MsgBox_Closing_Title = %{Program.Name} اغلاق
MsgBox_Closing_Messag = الآن %{Program.Name}هل تريد اغلاق؟?

[Update]
Window_Title_Available = التحديث متوفر
Window_Title_Congratulations = مبروك!
Window_Title_Error = حدث خطا ما!
Label_Message_Update = %{Program.Name} يتوفر اصدار جديد من.
Label_Message_Latest = %{Program.Name} انت تستخدم احدث اصدار من.
Label_Message_Error = %{Program.Name} تعذر استرداد معلومات حول احدث اصدار من.
Label_Message_Internet = الرجاء التحقق من اتصال انترنت والمحاولة مرة اخرى.
Label_Build_Current = البناء الحالي:
Label_Build_Update = تحديث البناء:
CheckBox_NoUpdate = لا تحقق من وجود تحديثات عند بدء التشغيل.
Button_Update = اقرا المزيد
Button_Close = اغلاق

[Versioning]
Administrator = مدير
Build = بناء
AutoIt_Version = autoIt٪ {AutoIt.Version} باستخدام اصدار
Bit = بت